# BuiltInFailures.SelectionFailures Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..SelectionFailures Members
BuiltInFailures..::..SelectionFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..SelectionFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NoElementSelected | No element selected. |
| NoValidElementSelected | No valid element selected. |

# See Also
BuiltInFailures..::..SelectionFailures Class
Autodesk.Revit.DB Namespace